class PrivacyPolicies {
  static const String privacy = """# 개인정보보호방침

< 더블디 >는 「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.

○ 이 개인정보처리방침은 2022년 5월 17부터 적용됩니다.



## 제1조(개인정보의 처리 목적)

< 더블디 >는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.

1. 홈페이지 회원가입 및 관리
- 회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종 고지·통지, 고충처리 목적으로 개인정보를 처리합니다.

2. 재화 또는 서비스 제공
- 서비스 제공, 본인인증을 목적으로 개인정보를 처리합니다.

3. 마케팅 및 광고에의 활용
- 신규 서비스(제품) 개발 및 맞춤 서비스 제공, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.




## 제2조(개인정보의 처리 및 보유 기간)

① < 더블디 >는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.

② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.



## 제3조(처리하는 개인정보의 항목)

① < 더블디 >는 다음의 개인정보 항목을 처리하고 있습니다.

- < 홈페이지 회원가입 및 관리 >
   - 필수항목 : 이메일, 비밀번호, 성별
   - 선택항목 : 휴대전화번호, 자택주소, 생년월일, 이름, 직업



## 제4조(개인정보의 파기절차 및 파기방법)

① < 더블디 > 는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.

② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.

③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
1. 파기절차
   - < 더블디 > 는 파기 사유가 발생한 개인정보를 선정하고, < 더블디 > 의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.

2. 파기방법
   - 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다



## 제5조(정보주체와 법정대리인의 권리·의무 및 그 행사방법에 관한 사항)

① 정보주체는 더블디에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.

② 제1항에 따른 권리 행사는더블디에 대해 「개인정보 보호법」 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 더블디는 이에 대해 지체 없이 조치하겠습니다.

③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다.이 경우 “개인정보 처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.

④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.

⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.

⑥ 더블디는 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.



## 제6조(개인정보의 안전성 확보조치에 관한 사항)

< 더블디 >는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.

1. 해킹 등에 대비한 기술적 대책
   - <더블디>('더블디')은 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.

2. 개인정보의 암호화
   - 이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.

3. 접속기록의 보관 및 위변조 방지
   - 개인정보처리시스템에 접속한 기록을 최소 1년 이상 보관, 관리하고 있으며,다만, 5만명 이상의 정보주체에 관하여 개인정보를 추가하거나, 고유식별정보 또는 민감정보를 처리하는 경우에는 2년이상 보관, 관리하고 있습니다.
   - 또한, 접속기록이 위변조 및 도난, 분실되지 않도록 보안기능을 사용하고 있습니다.

4. 개인정보에 대한 접근 제한
   - 개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.



## 제7조(개인정보를 자동으로 수집하는 장치의 설치·운영 및 그 거부에 관한 사항)

더블디 는 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용하지 않습니다.



## 제8조(행태정보의 수집·이용·제공 및 거부 등에 관한 사항)

① <개인정보처리자>은(는) 서비스 이용과정에서 정보주체에게 최적화된 맞춤형 서비스 및 혜택, 온라인 맞춤형 광고 등을 제공하기 위하여 행태정보를 수집·이용하고 있습니다.

② <개인정보처리자>은(는) 다음과 같이 행태정보를 수집합니다.
- 수집하는 행태정보의 항목	행태정보 수집 방법	행태정보 수집 목적	보유·이용기간 및 이후 정보처리 방법
이용자가 채팅을 시작할 때 추천 목록에서 시작했는지 또는 커뮤니티에서 시작했는지에 대한 정보	이용자가 서비스 이용 시 자동 수집	개인 맞춤형 정보 제공을 위함	



## 제9조(추가적인 이용·제공 판단기준)

< 더블디 > 는 ｢개인정보 보호법｣ 제15조제3항 및 제17조제4항에 따라 ｢개인정보 보호법 시행령｣ 제14조의2에 따른 사항을 고려하여 정보주체의 동의 없이 개인정보를 추가적으로 이용·제공할 수 있습니다.

이에 따라 < 더블디 > 가(이) 정보주체의 동의 없이 추가적인 이용·제공을 하기 위해서 다음과 같은 사항을 고려하였습니다.

- 개인정보를 추가적으로 이용·제공하려는 목적이 당초 수집 목적과 관련성이 있는지 여부

- 개인정보를 수집한 정황 또는 처리 관행에 비추어 볼 때 추가적인 이용·제공에 대한 예측 가능성이 있는지 여부

- 개인정보의 추가적인 이용·제공이 정보주체의 이익을 부당하게 침해하는지 여부

- 가명처리 또는 암호화 등 안전성 확보에 필요한 조치를 하였는지 여부

- ※ 추가적인 이용·제공 시 고려사항에 대한 판단기준은 사업자/단체 스스로 자율적으로 판단하여 작성·공개함



## 제10조(가명정보를 처리하는 경우 가명정보 처리에 관한 사항)

< 더블디 > 는 다음과 같은 목적으로 가명정보를 처리하고 있습니다.

- 가명정보의 처리 목적
   - 실명을 수집을 하지 않기 위함

- 가명처리하는 개인정보의 항목
   - 이름, 닉네임, 직업 

- 법 제28조의4(가명정보에 대한 안전조치 의무 등)에 따른 가명정보의 안전성 확보조치에 관한 사항
   - 상기 제11조와 동일



## 제11조 (개인정보 보호책임자에 관한 사항)

① < 더블디 > 는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

- 개인정보 보호책임자
   - 연락처 : doubld.app@gmail.com,
   - ※ 개인정보 보호 담당부서로 연결됩니다.


-  개인정보 보호 담당부서
   - 연락처 : doubld.app@gmail.com,

② 정보주체께서는 더블디의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. < 더블디 > 는 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.



## 제12조(개인정보의 열람청구를 접수·처리하는 부서)

정보주체는 ｢개인정보 보호법｣ 제35조에 따른 개인정보의 열람 청구를 아래의 부서에 할 수 있습니다.

< 더블디 > 는 정보주체의 개인정보 열람청구가 신속하게 처리되도록 노력하겠습니다.

- 개인정보 열람청구 접수·처리 부서
   - 연락처 : doubld.app@gmail.com,



## 제13조(정보주체의 권익침해에 대한 구제방법)

정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.

1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr)
4. 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)

「개인정보보호법」제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의 규정에 의한 요구에 대 하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.

- ※ 행정심판에 대해 자세한 사항은 중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.



## 제14조(개인정보 처리방침 변경)

① 이 개인정보처리방침은 2022년 5월 17부터 적용됩니다.

② 이전의 개인정보 처리방침은 아래에서 확인하실 수 있습니다.
 - 2021. 5. 17 ~ 20XX. X. X 적용 (현재 문서)""";

  static const String policies = """# 이용약관

## 제1조(목적)

더블디 서비스 이용약관은 서비스를 제공함에 있어, 이용자 간의 권리, 의무 및 책임 사항 등을 규정함을 목적으로 합니다.

## 제2조(정의)

1. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
   1. "서비스"란, 더블디가 제공하는 모든 서비스 및 기능을 말합니다.
   2. "이용자"란, 이 약관에 따라 서비스를 이용하는 회원 및 비회원을 말합니다.
   3. "회원"이란, 서비스에 회원등록을 하고 서비스를 이용하는 자를 말합니다.
   4. "비회원"이란, 서비스에 회원등록을 하지 않고 서비스를 이용하는 자를 말합니다.
   5. "게시물"이란, 서비스에 게재된 문자, 사진, 영상, 첨부파일, 광고 등을 말합니다.
   6. "커뮤니티"란, 게시물을 게시할 수 있는 공간을 말합니다.
   7. "이용 기록"이란, 이용자가 서비스를 이용하면서 직접 생성한 이용자 정보 등을 말합니다.
   8. "로그 기록"이란, 이용자가 서비스를 이용하면서 자동으로 생성된 행동 패턴, 접속시간 등을 말합니다.
   9. "기기 정보"란, 이용자의 통신 기기에서 수집된 운영체제 종류, ADID 등을 말합니다.
   10. "계정"이란, 이용계약을 통해 생성된 회원의 고유 아이디와 이에 수반하는 정보를 말합니다.
   11. "서비스 내부 알림 수단"이란, 팝업, 알림, 1:1 대화, 공지사항, 내 정보 메뉴 등을 말합니다.
   12. "연락처"란, 회원가입, 본인 인증, 문의 창구 등을 통해 수집된 이용자의 이메일, 휴대전화 번호 등을 의미합니다.
   13. "관련법"이란, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법, 통신비밀보호법 등 관련 있는 국내 법령을 말합니다.
   14. "본인 인증"이란, 이메일 등을 이용한 본인 확인 절차를 말합니다.
   15. 1항에서 정의되지 않은 약관 내 용어의 의미는 일반적인 이용관행에 의합니다.


## 제3조(약관 등의 명시와 설명 및 개정)

1. 더블디는 이 약관을 회원가입 화면 및 "내 정보" 메뉴 등에 게시합니다.
2. 더블디는 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
3. 개정 내용이 회원에게 불리할 경우, 적용일자 및 개정사유를 명시하여 현행약관과 함께 "공지사항"에 30일 간 게시합니다.
4. 회원이 개정약관의 적용에 동의하지 않는 경우, 이용계약을 해지함으로써 거부 의사를 표시할 수 있습니다. 단, 30일 내에 거부 의사 표시를 하지 않을 경우 약관에 동의한 것으로 간주합니다.
5. 회원은 약관 일부분만을 동의 또는 거부할 수 없습니다.
6. 비회원이 서비스를 이용할 경우, 이 약관에 동의한것으로 간주합니다.


## 제4조(서비스의 제공)

1. 더블디는 다음 서비스를 제공합니다.
   1. 지정 헌혈자 추천 서비스
   2. 커뮤니티 서비스
   3. 지정 헌혈 관련 정보 제공 서비스
   4. 할인, 이벤트, 프로모션, 광고 정보 제공 서비스
   5. 다른 회사 및 단체와의 협력을 통해 제공하는 서비스
   5. 기타 더블디가 정하는 서비스
2. 더블디는 운영상, 기술상의 필요에 따라 제공하고 있는 서비스를 변경할 수 있습니다.
3. 더블디는 이용자의 개인정보 및 서비스 이용 기록에 따라 서비스 이용에 차이를 둘 수 있습니다.
4. 더블디는 천재지변, 인터넷 장애, 경영 악화 등으로 인해 서비스를 더 이상 제공하기 어려울 경우, 서비스를 통보 없이 중단할 수 있습니다.
5. 더블디는 1항부터 전항까지와 다음 내용으로 인해 발생한 피해에 대해 어떠한 책임을 지지 않습니다.
   1. 모든 서비스, 게시물, 이용 기록의 진본성, 무결성, 신뢰성, 이용가능성
   2. 서비스 이용 중 타인과 상호 간에 합의한 내용
   3. 게시물, 광고의 버튼, 하이퍼링크 등 외부로 연결된 서비스와 같이 더블디가 제공하지 않은 서비스에서 발생한 피해
   4. 이용자의 귀책사유 또는 더블디의 귀책 사유가 아닌 사유로 발생한 이용자의 피해


## 제5조(서비스 이용계약의 성립)

1. 더블디와 회원의 서비스 이용계약은 서비스 내부의 회원가입 화면의 가입 양식에 따라 회원정보를 기입한 후 필수 약관에 동의한다는 의사표시를 한 비회원의 이용신청에 대하여, 서비스 화면에 이용승낙을 표시하는 방법 등으로 의사표시를 하면서 체결됩니다.
2. 승낙은 신청순서에 따라 순차적으로 처리되며, 회원가입의 성립시기는 더블디의 승낙이 회원에게 도달한 시점으로 합니다.
3. 더블디는 부정사용방지 및 본인확인을 위해 회원에게 본인 인증을 요청할 수 있습니다.


## 제6조(개인정보의 관리 및 보호)

1. 회원이 더블디와 체결한 서비스 이용계약은 처음 이용계약을 체결한 본인에 한해 적용됩니다.
2. 회원은 회원가입 시 등록한 정보에 변동이 있을 경우, 즉시 "내 정보" 메뉴 등을 이용하여 정보를 최신화해야 합니다.
3. 회원의 아이디, 비밀번호, 이메일 정보 등 모든 개인정보의 관리책임은 본인에게 있으므로, 타인에게 양도 및 대여할 수 없으며, 유출되지 않도록 관리해야 합니다. 만약 본인의 아이디 및 비밀번호를 타인이 사용하고 있음을 인지했을 경우 바로 서비스 내부의 문의 창구에 알려야 하고, 안내가 있는 경우 이에 즉시 따라야 합니다.
4. 더블디는 2항부터 전항까지를 이행하지 않아 발생한 피해에 대해 어떠한 책임을 지지 않습니다.


## 제7조(서비스 이용계약의 종료)

1. 회원은 언제든지 본인의 계정으로 로그인한 뒤 서비스 내부 문의 메일링 기능을 통해 "탈퇴하기" 버튼을 누르는 방법으로 탈퇴를 요청할 수 있습니다. 더블디는 해당 요청을 확인한 후 탈퇴를 처리합니다.
2. 회원은 관리하고 있는 커뮤니티가 있을 경우, 이를 양도하거나 삭제하기 전까지 탈퇴를 할 수 없습니다.
3. 탈퇴 처리가 완료 되었더라도, 회원이 게시한 게시물은 삭제되지 않습니다.
4. 더블디는 회원이 연속하여 1년 동안 로그인을 하지 않을 경우, 회원의 동의 없이 회원자격을 박탈할 수 있습니다.
5. 더블디는 천재지변, 테러 등 불가피한 사유로 더 이상 서비스를 제공할 수 없을 경우, 회원의 동의 없이 회원자격을 박탈할 수 있습니다.
5. 더블디는 1항부터 전항까지로 인해 발생한 피해에 대해 어떠한 책임을 지지 않습니다.


## 제8조(회원에 대한 통보)

1. 더블디가 회원에 대한 통보를 하는 경우, 서비스 내부 알림 수단과 회원의 연락처를 이용합니다.
2. 더블디는 다수의 회원에 대한 통보를 할 경우 공지사항 등에 게시함으로써 개별 통보에 갈음할 수 있습니다.
3. 회원이 30일 이내에 의사 표시를 하지 않을 경우, 통보 내용에 대해 동의한 것으로 간주합니다.


## 제9조(저작권의 귀속)

1. 더블디는 유용하고 편리한 서비스를 제공하기 위해, 서비스 및 서비스 내부의 기능()의 체계와 다양한 기능()을 직접 설계 및 운영하고 있는 데이터베이스 제작자에 해당합니다. 더블디는 저작권법에 따라 데이터베이스 제작자는 복제권 및 전송권을 포함한 데이터베이스 전부에 대한 권리를 가지고 있으며, 이는 법률에 따라 보호를 받는 대상입니다. 그러므로 이용자는 데이터베이스 제작자인 더블디의 승인 없이 데이터베이스의 전부 또는 일부를 복제·배포·방송 또는 전송할 수 없습니다.
2. 더블디가 작성한 게시물에 대한 권리는 더블디에게 귀속되며, 회원이 작성한 게시물에 대한 권리는 회원에게 귀속됩니다. 단, 더블디는 서비스의 운영, 확장, 홍보 등의 필요한 목적으로 회원의 저작물을 합리적이고 필요한 범위 내에서 별도의 허락 없이 수정하여 무상으로 사용하거나 제휴사에게 제공할 수 있습니다. 이 경우, 회원의 개인정보는 제공하지 않습니다.
3. 더블디는 전항 이외의 방법으로 회원의 게시물을 이용할 경우, 서비스 내부 알림 수단과 회원의 연락처를 이용하여 회원의 동의를 받아야 합니다.


## 제10조(게시물의 게시 중단)

1. 더블디는 관련법에 의거하여 회원의 게시물로 인한 법률상 이익 침해를 근거로, 다른 이용자 또는 제3자가 회원 또는 더블디를 대상으로 하여 민형사상의 법적 조치를 취하거나 관련된 게시물의 게시중단을 요청하는 경우, 더블디는 해당 게시물에 대한 접근을 잠정적으로 제한하거나 삭제할 수 있습니다.


## 제11조(광고의 게재 및 발신)

1. 더블디는 서비스의 제공을 위해 서비스 내부에 광고를 게재할 수 있습니다.
2. 더블디는 이용자의 이용 기록을 활용한 광고를 게재할 수 있습니다.
3. 더블디는 회원이 광고성 정보 수신에 동의할 경우, 서비스 내부 알림 수단과 회원의 연락처를 이용하여 광고성 정보를 발신할 수 있습니다.
4. 더블디는 광고 게재 및 동의된 광고성 정보의 발신으로 인해 발생한 피해에 대해 어떠한 책임을 지지 않습니다.


## 제12조(금지행위)

1. 이용자는 다음과 같은 행위를 해서는 안됩니다.
   1. 개인정보 또는 계정 기만, 침해, 공유 행위
      1. 개인정보를 허위, 누락, 오기, 도용하여 작성하는 행위
      2. 타인의 개인정보 및 계정을 수집, 저장, 공개, 이용하는 행위
      3. 자신과 타인의 개인정보를 제3자에게 공개, 양도하는 행위
      4. 다중 계정을 생성 및 이용하는 행위
      5. 자신의 계정을 이용하여 타인의 요청을 이행하는 행위
   2. 시스템 부정행위
      1. 허가하지 않은 방식의 서비스 이용 행위
      2. 더블디의 모든 재산에 대한 침해 행위
   3. 업무 방해 행위
      1. 서비스 관리자 또는 이에 준하는 자격을 사칭하거나 허가없이 취득하여 직권을 행사하는 행위
      2. 더블디 및 타인의 명예를 손상시키거나 업무를 방해하는 행위
      3. 서비스 내부 정보 일체를 허가 없이 이용, 변조, 삭제 및 외부로 유출하는 행위
   4. 이 약관, 개인정보 처리방침, 커뮤니티 이용규칙에서 이행 및 비이행을 명시한 내용에 반하는 행위
   5. 기타 현행법에 어긋나거나 부적절하다고 판단되는 행위
2. 이용자가 1항에 해당하는 행위를 할 경우, 더블디는 다음과 같은 조치를 영구적으로 취할 수 있습니다.
   1. 이용자의 서비스 이용 권한, 자격, 혜택 제한 및 회수
   2. 회원과 체결된 이용계약을 회원의 동의나 통보 없이 파기
   3. 회원가입, 본인 인증 거부
   4. 회원의 커뮤니티, 게시물, 이용기록을 임의로 삭제, 중단, 변경
   5. 그 외 더블디가 필요하다고 판단되는 조치
3. 더블디는 1항부터 전항까지로 인해 발생한 피해에 대해 어떠한 책임을 지지 않으며, 이용자는 귀책사유로 인해 발생한 모든 손해를 배상할 책임이 있습니다.


## 제13조(재판권 및 준거법)

1. 더블디와 이용자 간에 발생한 분쟁에 관한 소송은 대한민국 경기중앙지방법원을 관할 법원으로 합니다. 다만, 제소 당시 이용자의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.
2. 더블디와 이용자 간에 제기된 소송에는 한국법을 적용합니다.


## 제14조(기타)

1. 이 약관은 2022년 5월 17일에 최신화 되었습니다.
2. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 관련법 또는 관례에 따릅니다.
3. 이 약관에도 불구하고 다른 약관이나 서비스 이용 중 안내 문구 등으로 달리 정함이 있는 경우에는 해당 내용을 우선으로 합니다.""";

  static const String ossNotice = """# OSS Notice

This Flutter application is Copyright Double D. All right reserved.

The following sets forth attribution notices for third part software that may be contained in this application.



## flutter 
- https://flutter.dev
- BSD-3-Clause License
  
## dart
- https://dart.dev
- BSD-3-Clause License  
  
## flutter_test
- https://pub.dev/packages/flutter_test
- BSD-3-Clause License

## cupertino_icons
- https://pub.dev/packages/cupertino_icons
- MIT License

## carousel_slider
- https://pub.dev/packages/carousel_slider
- MIT License

## url_launcher
- https://pub.dev/packages/url_launcher
- BSD-3-Clause License

## jwt_decode
- https://pub.dev/packages/jwt_decode
- BSD-3-Clause License

## intl
- https://pub.dev/packages/intl
- BSD-3-Clause License

## http
- https://pub.dev/packages/http
- BSD-3-Clause License

## firebase_core
- https://pub.dev/packages/firebase_core
- BSD-3-Clause License

## cloud_firestore
- https://pub.dev/packages/cloud_firestore
- BSD-3-Clause License

## firebase_analytics
- https://pub.dev/packages/firebase_analytics
- BSD-3-Clause License

## firebase_messaging
- https://pub.dev/packages/firebase_messaging
- BSD-3-Clause License

## flutter_local_notifications
- https://pub.dev/packages/flutter_local_notifications
- BSD-3-Clause License

## flutter_app_badger
- https://pub.dev/packages/flutter_app_badger
- Apache License 2.0

## image_picker
- https://pub.dev/packages/image_picker
- Apache License 2.0, BSD-3-Clause License

## image
- https://pub.dev/packages/image
- MIT License

## get
- https://pub.dev/packages/get
- MIT License

## fluttertoast
- https://pub.dev/packages/fluttertoast
- MIT License

## vibration
- https://pub.dev/packages/vibration
- BSD-2-Clause License

## shared_preferences
- https://pub.dev/packages/shared_preferences
- BSD-3-Clause License



# MIT License

Copyright (c) 2022 Double D

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
""";
}
